app/views/npi_records/index.html.erb

      <td><%=  npi_record.basic_datum.name %></td>
      <td><%= npi_record.addresses.find_by(address_purpose: 'LOCATION').to_s %></td>
      <td><%= npi_record.basic_datum.credential %></td>
      <td><%= npi_record.taxonomies.take.to_s  %></td>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."npi_record_id" = ? AND "addresses"."address_purpose" = ? LIMIT ?  [["npi_record_id", 2], ["address_purpose", "LOCATION"], ["LIMIT", 1]]
SELECT "taxonomies".* FROM "taxonomies" WHERE "taxonomies"."npi_record_id" = ? LIMIT ?  [["npi_record_id", 2], ["LIMIT", 1]]