app/controllers/npi_records_controller.rb

  def index
    @npi_records = NpiRecord.all.reload.order('ordinal_position DESC')
---
SELECT "npi_records".* FROM "npi_records" ORDER BY ordinal_position DESC